slides/理解Http与Spdy协议.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>理解Http与Spdy协议</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="理解Http与Spdy协议"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-25T23:34+0800"/>
<meta name="author" content="唐新发"/>
<meta name="description" content="120 Minutes"/>
<meta name="keywords" content=""/>
<!-- configuration parameters -->
<meta name="defaultView" content="slideshow" />
<meta name="controlVis" content="hidden" />
<!-- style sheet links -->
<link rel="stylesheet" href="ui/default/slides.css" type="text/css" media="projection" id="slideProj" />
<link rel="stylesheet" href="ui/default/outline.css" type="text/css" media="screen" id="outlineStyle" />
<link rel="stylesheet" href="ui/default/print.css" type="text/css" media="print" id="slidePrint" />
<link rel="stylesheet" href="ui/default/opera.css" type="text/css" media="projection" id="operaFix" />
<!-- S5 JS -->

</head>
<body>

<div id="preamble">

</div>

<div class="layout">
<div id="controls"><!-- no edit --></div>
<div id="currentSlide"><!-- no edit --></div>
<div id="header"><div id="timer"><span id="timeLeft">
120
</span>Minutes</div></div>
<div id="footer">
<h1>唐新发 - 理解Http与Spdy协议</h1>
</div>
</div>

<div class="presentation">
<div class="slide">
<h1>理解Http与Spdy协议</h1>
<h1>唐新发</h1>
<h1>2013-05-25</h1>
</div>
<h1 class="title">理解Http与Spdy协议</h1>


<div id="outline-container-1" class="outline-1 slide">
<h1 id="sec-1"><span class="section-number-1">1</span> 什么是Http协议</h1>
<div class="outline-text-1" id="text-1">


<p>
  HyperText Transfer Protocol
</p>
<p>
  超文本传输协议
</p>
<p>
  <a href="http://www.w3.org/Protocols/rfc2616/rfc2616.html">RFC2616</a>
</p>
<p>
  <b>http</b>://
</p>



<div class="notes">
<blockquote>

<p>  <a href="http://zh.wikipedia.org/zh-cn/超文本传输协议"><b>维基百科</b></a>：
</p>
<p>
  　　超文本传输协议（英文：HyperText Transfer Protocol，缩写：HTTP）是互联网上应用最为广泛的一种网络协议。设计HTTP最初的目的是为了提供一种发布和接收HTML页面的方法。通过HTTP或者HTTPS协议请求的资源由统一资源标识符（Uniform Resource Identifiers，URI）来标识。: 
HTTP的发展是万维网协会（World Wide Web Consortium）和Internet工作小组（Internet Engineering Task Force）合作的结果，（他们）最终发布了一系列的RFC，其中最著名的RFC 2616，定义了HTTP协议中现今广泛使用的一个版本—HTTP 1.1。
</p>
<p>
  　　HTTP是一个客户端终端（用户）和服务器端（网站）请求和应答的标准（TCP）。通过使用Web浏览器、网络爬虫或者其它的工具，客户端发起一个HTTP请求到服务器上指定端口（默认端口为80）。我们称这个客户端为用户代理程序（user agent）。应答的服务器上存储着一些资源，比如HTML文件和图像。我们称这个应答服务器为源服务器（origin server）。在用户代理和源服务器中间可能存在多个中间层，比如代理，网关，或者隧道（tunnel）。
</p>
<p>
  　　尽管TCP/IP协议是互联网上最流行的应用，HTTP协议中，并没有规定必须使用它或它支持的层。事实上，HTTP可以在任何互联网协议上，或其他网络上实现。HTTP假定其下层协议提供可靠的传输。因此，任何能够提供这种保证的协议都可以被其使用。
通常，由HTTP客户端发起一个请求，创建一个到服务器指定端口（默认是80端口）的TCP连接。HTTP服务器则在那个端口监听客户端的请求。一旦收到请求，服务器会向客户端返回一个状态，比如"HTTP/1.1 200 OK"，以及返回的内容，如请求的文件、错误消息、或者其它信息。
HTTP使用TCP而不是UDP的原因在于：打开一个网页必须传送很多数据，而TCP协议提供传输控制，顺序组织数据和错误纠正。具体细节请参考‘TCP和UDP的不同’。
</p>
</blockquote>





</div
</div>

</div>

<div id="outline-container-2" class="outline-1 slide">
<h1 id="sec-2"><span class="section-number-1">2</span> 大事记</h1>
<div class="outline-text-1" id="text-2">


<p>
  1990 HTTP诞生
</p>
<p>    
  1991 <a href="http://www.w3.org/pub/WWW/Protocols/HTTP/AsImplemented.html">HTTP 0.9</a>
</p>
<p>   
  1996 <a href="http://tools.ietf.org/html/rfc1945">HTTP 1.0</a>
</p>
<p>    
  1999 <a href="http://tools.ietf.org/html/rfc2616">HTTP 1.1</a>    
</p>



<div class="notes">
<p>
  　　HTTP是万维网(WWW, World Wide Web)的支撑协议，WWW联盟组织了IETE（Internet Engineering Task Force）小组对HTTP协议进行不断地完善，相继推出了<a href="http://www.w3.org/pub/WWW/Protocols/HTTP/AsImplemented.html">HTTP 0.9</a>、<a href="http://tools.ietf.org/html/rfc1945">HTTP 1.0</a>、<a href="http://tools.ietf.org/html/rfc2616">HTTP 1.1</a>。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">时间</th><th scope="col" class="right">版本</th><th scope="col" class="left">　特性</th><th scope="col" class="left">状态</th></tr>
</thead>
<tbody>
<tr><td class="right">1990</td><td class="right"></td><td class="left">未文档化</td><td class="left">过时</td></tr>
<tr><td class="right">1991</td><td class="right">0.9</td><td class="left">GET方法，仅用于从服务器获取html页面</td><td class="left">过时</td></tr>
<tr><td class="right">1996</td><td class="right">1.0</td><td class="left">POST和HEAD方法，版本号、消息头、MIME、字符集、缓存、认证、压缩传输、响应码等</td><td class="left">尚有使用</td></tr>
<tr><td class="right">1999</td><td class="right">1.1</td><td class="left">OPTIONS、PUT、DELETE、TRACE、CONNECT方法，持久连接、虚拟主机、断点续传、分块传输等</td><td class="left">主流</td></tr>
</tbody>
</table>




</div
</div>

</div>

<div id="outline-container-3" class="outline-1 slide">
<h1 id="sec-3"><span class="section-number-1">3</span> 特点</h1>
<div class="outline-text-1" id="text-3">


<p>  
  开放标准
</p>
<p>
  基于文本
</p>
<p>
  客户端请求／服务器应答模式
</p>
<p>
  灵活协商
</p>
<p>
  无状态
</p>



<div class="notes">

</div
</div>

</div>

<div id="outline-container-4" class="outline-1 slide">
<h1 id="sec-4"><span class="section-number-1">4</span> Hello World</h1>
<div class="outline-text-1" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-1 slide">
<h1 id="sec-5"><span class="section-number-1">5</span> 交互图</h1>
<div class="outline-text-1" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-1 slide">
<h1 id="sec-6"><span class="section-number-1">6</span> 请求语法</h1>
<div class="outline-text-1" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-1 slide">
<h1 id="sec-7"><span class="section-number-1">7</span> 响应语法</h1>
<div class="outline-text-1" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-1 slide">
<h1 id="sec-8"><span class="section-number-1">8</span> 常见的请求</h1>
<div class="outline-text-1" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-1 slide">
<h1 id="sec-9"><span class="section-number-1">9</span> 常见的响应</h1>
<div class="outline-text-1" id="text-9">

</div>

</div>

<div id="outline-container-10" class="outline-1 slide">
<h1 id="sec-10"><span class="section-number-1">10</span> REST</h1>
<div class="outline-text-1" id="text-10">

</div>

</div>

<div id="outline-container-11" class="outline-1 slide">
<h1 id="sec-11"><span class="section-number-1">11</span> 设计RESTful API</h1>
<div class="outline-text-1" id="text-11">

</div>

</div>

<div id="outline-container-12" class="outline-1 slide">
<h1 id="sec-12"><span class="section-number-1">12</span> 特性</h1>
<div class="outline-text-1" id="text-12">

</div>

</div>

<div id="outline-container-13" class="outline-1 slide">
<h1 id="sec-13"><span class="section-number-1">13</span> 断点继传</h1>
<div class="outline-text-1" id="text-13">

</div>

</div>

<div id="outline-container-14" class="outline-1 slide">
<h1 id="sec-14"><span class="section-number-1">14</span> 持久连接</h1>
<div class="outline-text-1" id="text-14">

</div>

</div>

<div id="outline-container-15" class="outline-1 slide">
<h1 id="sec-15"><span class="section-number-1">15</span> 压缩传输</h1>
<div class="outline-text-1" id="text-15">

</div>

</div>

<div id="outline-container-16" class="outline-1 slide">
<h1 id="sec-16"><span class="section-number-1">16</span> 缓存优化</h1>
<div class="outline-text-1" id="text-16">

</div>

</div>

<div id="outline-container-17" class="outline-1 slide">
<h1 id="sec-17"><span class="section-number-1">17</span> 会话管理</h1>
<div class="outline-text-1" id="text-17">

</div>

</div>

<div id="outline-container-18" class="outline-1 slide">
<h1 id="sec-18"><span class="section-number-1">18</span> 最新发展</h1>
<div class="outline-text-1" id="text-18">

</div>
</div>
</div>

</body>
</html>
